<!-- terraform cdk action for options with hash 9112aaea877cb4fd6cfa3fb30f6eb567 -->
### ✅ Successfully applied Terraform CDK Stack 'lambda-auth'



<details><summary>Show Run</summary>

```shell
lambda-auth  Initializing the backend...
lambda-auth  Successfully configured the backend "remote"! Terraform will automatically
             use this backend unless the backend configuration changes.
lambda-auth  Initializing provider plugins...
             - Finding hashicorp/aws versions matching "4.50.0"...
lambda-auth  - Finding hashicorp/random versions matching "3.4.3"...
lambda-auth  - Installing hashicorp/aws v4.50.0...
lambda-auth  - Installed hashicorp/aws v4.50.0 (signed by HashiCorp)
lambda-auth  - Installing hashicorp/random v3.4.3...
lambda-auth  - Installed hashicorp/random v3.4.3 (signed by HashiCorp)

             Terraform has created a lock file .terraform.lock.hcl to record the provider
             selections it made above. Include this file in your version control repository
             so that Terraform can guarantee to make the same selections by default when
             you run "terraform init" in the future.
lambda-auth  Terraform has been successfully initialized!

             You may now begin working with Terraform. Try running "terraform plan" to see
             any changes that are required for your infrastructure. All Terraform commands
             should now work.

             If you ever set or change modules or backend configuration for Terraform,
             rerun this command to reinitialize your working directory. If you forget, other
             commands will detect it and remind you to do so if necessary.
lambda-auth  - Fetching hashicorp/random 3.4.3 for linux_amd64...
lambda-auth  - Retrieved hashicorp/random 3.4.3 for linux_amd64 (signed by HashiCorp)
lambda-auth  - Fetching hashicorp/aws 4.50.0 for linux_amd64...
lambda-auth  - Retrieved hashicorp/aws 4.50.0 for linux_amd64 (signed by HashiCorp)
             - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
             - Obtained hashicorp/random checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
lambda-auth  Success! Terraform has validated the lock file and found no need for changes.
lambda-auth  Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
             will cancel the remote apply if it's still pending. If the apply started it
             will stop streaming the logs, but will not stop the apply running remotely.

             Preparing the remote apply...
lambda-auth  To view this run in a browser, visit:
             https://app.terraform.io/app/pos-fiap/cdktf-lambda-auth/runs/run-XmnbnuP3Kfud4hv1
lambda-auth  Waiting for the plan to start...
lambda-auth  Terraform v1.7.4
             on linux_amd64
             Initializing plugins and modules...
lambda-auth  Terraform used the selected providers to generate the following execution
             plan. Resource actions are indicated with the following symbols:
               + create

             Terraform will perform the following actions:

               # aws_api_gateway_deployment.lambda-auth (api-gw-deployment) will be created
               + resource "aws_api_gateway_deployment" "lambda-auth" {
                   + created_date  = (known after apply)
                   + execution_arn = (known after apply)
                   + id            = (known after apply)
                   + invoke_url    = (known after apply)
                   + rest_api_id   = (known after apply)
                   + triggers      = (known after apply)
                 }

               # aws_api_gateway_integration.lambda-auth (AuthenticateUserApiGatewayIntegration) will be created
lambda-auth  + resource "aws_api_gateway_integration" "lambda-auth" {
                   + cache_namespace         = (known after apply)
                   + connection_type         = "INTERNET"
                   + http_method             = "POST"
                   + id                      = (known after apply)
                   + integration_http_method = "POST"
                   + passthrough_behavior    = (known after apply)
                   + resource_id             = (known after apply)
                   + rest_api_id             = (known after apply)
                   + timeout_milliseconds    = 29000
                   + type                    = "AWS_PROXY"
                   + uri                     = (known after apply)
                 }

               # aws_api_gateway_method.lambda-auth (AuthenticateUserApiGatewayMethod) will be created
               + resource "aws_api_gateway_method" "lambda-auth" {
                   + api_key_required = false
                   + authorization    = "NONE"
                   + http_method      = "POST"
                   + id               = (known after apply)
                   + resource_id      = (known after apply)
                   + rest_api_id      = (known after apply)
                 }

               # aws_api_gateway_resource.lambda-auth (authenticate-user-resource) will be created
               + resource "aws_api_gateway_resource" "lambda-auth" {
                   + id          = (known after apply)
                   + parent_id   = (known after apply)
                   + path        = (known after apply)
                   + path_part   = "authenticate"
                   + rest_api_id = (known after apply)
                 }

               # aws_api_gateway_rest_api.api-gw (api-gw) will be created
               + resource "aws_api_gateway_rest_api" "api-gw" {
                   + api_key_source               = (known after apply)
                   + arn                          = (known after apply)
                   + binary_media_types           = (known after apply)
                   + created_date                 = (known after apply)
                   + description                  = "API Gateway"
                   + disable_execute_api_endpoint = (known after apply)
                   + execution_arn                = (known after apply)
                   + id                           = (known after apply)
                   + minimum_compression_size     = -1
                   + name                         = "lambda-auth"
                   + policy                       = (known after apply)
                   + root_resource_id             = (known after apply)
                   + tags_all                     = (known after apply)

                   + endpoint_configuration {
                       + types            = [
                           + "REGIONAL",
lambda-auth  ]
                       + vpc_endpoint_ids = (known after apply)
                     }
                 }

               # aws_api_gateway_stage.lambda-auth (api-gw-stage) will be created
lambda-auth  + resource "aws_api_gateway_stage" "lambda-auth" {
                   + arn           = (known after apply)
                   + deployment_id = (known after apply)
                   + execution_arn = (known after apply)
                   + id            = (known after apply)
                   + invoke_url    = (known after apply)
                   + rest_api_id   = (known after apply)
                   + stage_name    = "v1"
                   + tags_all      = (known after apply)
                   + web_acl_arn   = (known after apply)
                 }

               # aws_cognito_user_pool.UserPool (UserPool) will be created
               + resource "aws_cognito_user_pool" "UserPool" {
                   + arn                        = (known after apply)
                   + auto_verified_attributes   = [
                       + "email",
                     ]
                   + creation_date              = (known after apply)
                   + custom_domain              = (known after apply)
                   + deletion_protection        = "INACTIVE"
                   + domain                     = (known after apply)
                   + email_verification_message = (known after apply)
                   + email_verification_subject = (known after apply)
                   + endpoint                   = (known after apply)
                   + estimated_number_of_users  = (known after apply)
                   + id                         = (known after apply)
                   + last_modified_date         = (known after apply)
                   + mfa_configuration          = "OFF"
                   + name                       = "userpool-lambda-auth"
                   + sms_verification_message   = (known after apply)
                   + tags_all                   = (known after apply)
                   + username_attributes        = [
                       + "email",
                     ]

                   + account_recovery_setting {
                       + recovery_mechanism {
                           + name     = "verified_email"
                           + priority = 1
                         }
                     }

                   + schema {
                       + attribute_data_type = "String"
                       + mutable             = true
                       + name                = "cpf"

                       + string_attribute_constraints {
                           + max_length = "11"
                           + min_length = "11"
                         }
                     }
                 }

               # aws_cognito_user_pool_client.UserPoolClient (UserPoolClient) will be created
               + resource "aws_cognito_user_pool_client" "UserPoolClient" {
                   + allowed_oauth_flows                  = [
                       + "code",
                       + "implicit",
                     ]
                   + allowed_oauth_flows_user_pool_client = true
                   + allowed_oauth_scopes                 = [
                       + "email",
                       + "openid",
                     ]
                   + auth_session_validity                = 3
                   + callback_urls                        = [
                       + "https://example.com",
                     ]
                   + client_secret                        = (sensitive value)
                   + enable_token_revocation              = (known after apply)
                   + explicit_auth_flows                  = [
lambda-auth  + "ADMIN_NO_SRP_AUTH",
                       + "USER_PASSWORD_AUTH",
                     ]
                   + id                                   = (known after apply)
lambda-auth  + logout_urls                          = (known after apply)
                   + name                                 = "userpool-client-lambda-auth"
                   + prevent_user_existence_errors        = (known after apply)
                   + refresh_token_validity               = 30
                   + supported_identity_providers         = [
                       + "COGNITO",
                     ]
                   + user_pool_id                         = (known after apply)
                 }

               # aws_cognito_user_pool_domain.UserPoolDomain (UserPoolDomain) will be created
               + resource "aws_cognito_user_pool_domain" "UserPoolDomain" {
                   + aws_account_id              = (known after apply)
                   + cloudfront_distribution_arn = (known after apply)
                   + domain                      = (known after apply)
                   + id                          = (known after apply)
                   + s3_bucket                   = (known after apply)
                   + user_pool_id                = (known after apply)
                   + version                     = (known after apply)
                 }

               # aws_iam_role.lambda-exec (lambda-exec) will be created
               + resource "aws_iam_role" "lambda-exec" {
                   + arn                   = (known after apply)
                   + assume_role_policy    = jsonencode(
                         {
                           + Statement = [
                               + {
                                   + Action    = "sts:AssumeRole"
                                   + Effect    = "Allow"
                                   + Principal = {
                                       + Service = "lambda.amazonaws.com"
                                     }
                                   + Sid       = ""
                                 },
                             ]
                           + Version   = "2012-10-17"
                         }
                     )
                   + create_date           = (known after apply)
                   + force_detach_policies = false
                   + id                    = (known after apply)
                   + managed_policy_arns   = (known after apply)
                   + max_session_duration  = 3600
                   + name                  = (known after apply)
                   + name_prefix           = (known after apply)
                   + path                  = "/"
                   + tags_all              = (known after apply)
                   + unique_id             = (known after apply)
                 }

               # aws_iam_role_policy.LambdaRolePolicy (LambdaRolePolicy) will be created
               + resource "aws_iam_role_policy" "LambdaRolePolicy" {
                   + id     = (known after apply)
                   + name   = (known after apply)
                   + policy = jsonencode(
                         {
                           + Statement = [
                               + {
                                   + Action   = "ssm:GetParameter"
                                   + Effect   = "Allow"
                                   + Resource = "*"
                                 },
                             ]
                           + Version   = "2012-10-17"
                         }
                     )
                   + role   = (known after apply)
                 }

               # aws_iam_role_policy_attachment.lambda-managed-policy (lambda-managed-policy) will be created
               + resource "aws_iam_role_policy_attachment" "lambda-managed-policy" {
                   + id         = (known after apply)
                   + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
                   + role       = (known after apply)
                 }

               # aws_lambda_function.auth-lambda-func (auth-lambda-func) will be created
               + resource "aws_lambda_function" "auth-lambda-func" {
                   + architectures                  = (known after apply)
                   + arn                            = (known after apply)
                   + function_name                  = (known after apply)
                   + handler                        = "index.handler"
                   + id                             = (known after apply)
                   + invoke_arn                     = (known after apply)
                   + last_modified                  = (known after apply)
                   + memory_size                    = 128
                   + package_type                   = "Zip"
                   + publish                        = true
                   + qualified_arn                  = (known after apply)
                   + qualified_invoke_arn           = (known after apply)
                   + reserved_concurrent_executions = -1
                   + role                           = (known after apply)
                   + runtime                        = "nodejs16.x"
                   + s3_bucket                      = (known after apply)
lambda-auth  + s3_key                         = "v0.1/archive.zip"
                   + signing_job_arn                = (known after apply)
                   + signing_profile_version_arn    = (known after apply)
                   + source_code_hash               = (known after apply)
                   + source_code_size               = (known after apply)
                   + tags_all                       = (known after apply)
                   + timeout                        = 3
                   + version                        = (known after apply)
                 }

               # aws_lambda_permission.apigw-lambda (apigw-lambda) will be created
               + resource "aws_lambda_permission" "apigw-lambda" {
                   + action              = "lambda:InvokeFunction"
                   + function_name       = (known after apply)
                   + id                  = (known after apply)
                   + principal           = "apigateway.amazonaws.com"
                   + source_arn          = (known after apply)
                   + statement_id        = (known after apply)
                   + statement_id_prefix = (known after apply)
                 }

               # aws_s3_bucket.bucket (bucket) will be created
               + resource "aws_s3_bucket" "bucket" {
                   + acceleration_status         = (known after apply)
                   + acl                         = (known after apply)
                   + arn                         = (known after apply)
                   + bucket                      = (known after apply)
                   + bucket_domain_name          = (known after apply)
                   + bucket_prefix               = "cdktf-lambda-auth"
                   + bucket_regional_domain_name = (known after apply)
                   + force_destroy               = false
                   + hosted_zone_id              = (known after apply)
                   + id                          = (known after apply)
                   + object_lock_enabled         = (known after apply)
                   + policy                      = (known after apply)
                   + region                      = (known after apply)
                   + request_payer               = (known after apply)
                   + tags_all                    = (known after apply)
                   + website_domain              = (known after apply)
                   + website_endpoint            = (known after apply)
                 }

               # aws_s3_object.lambda-archive (lambda-archive) will be created
               + resource "aws_s3_object" "lambda-archive" {
                   + acl                    = "private"
                   + bucket                 = (known after apply)
                   + bucket_key_enabled     = (known after apply)
                   + content_type           = (known after apply)
                   + etag                   = (known after apply)
                   + force_destroy          = false
                   + id                     = (known after apply)
                   + key                    = "v0.1/archive.zip"
                   + kms_key_id             = (known after apply)
                   + server_side_encryption = (known after apply)
                   + source                 = "assets/lambda-asset/12F08592D7D6032B82F1D7D924AC05F1/archive.zip"
                   + storage_class          = (known after apply)
                   + tags_all               = (known after apply)
                   + version_id             = (known after apply)
                 }

               # aws_ssm_parameter.LambdaUrl (LambdaUrl) will be created
               + resource "aws_ssm_parameter" "LambdaUrl" {
                   + arn            = (known after apply)
                   + data_type      = (known after apply)
                   + id             = (known after apply)
                   + insecure_value = (known after apply)
                   + key_id         = (known after apply)
                   + name           = "/lambda-auth/lambdaUrl"
                   + tags_all       = (known after apply)
                   + tier           = (known after apply)
                   + type           = "String"
                   + value          = (sensitive value)
                   + version        = (known after apply)
                 }

               # aws_ssm_parameter.UserPoolClientIdParameter (UserPoolClientIdParameter) will be created
               + resource "aws_ssm_parameter" "UserPoolClientIdParameter" {
                   + arn            = (known after apply)
                   + data_type      = (known after apply)
                   + id             = (known after apply)
                   + insecure_value = (known after apply)
                   + key_id         = (known after apply)
                   + name           = "/lambda-auth/userPoolClientId"
                   + overwrite      = true
                   + tags_all       = (known after apply)
                   + tier           = (known after apply)
                   + type           = "String"
lambda-auth  + value          = (sensitive value)
                   + version        = (known after apply)
                 }

               # aws_ssm_parameter.UserPoolIdParameter (UserPoolIdParameter) will be created
               + resource "aws_ssm_parameter" "UserPoolIdParameter" {
                   + arn            = (known after apply)
                   + data_type      = (known after apply)
                   + id             = (known after apply)
                   + insecure_value = (known after apply)
                   + key_id         = (known after apply)
                   + name           = "/lambda-auth/userPoolId"
                   + overwrite      = true
                   + tags_all       = (known after apply)
                   + tier           = (known after apply)
                   + type           = "String"
                   + value          = (sensitive value)
                   + version        = (known after apply)
                 }

               # random_pet.random-name (random-name) will be created
               + resource "random_pet" "random-name" {
                   + id        = (known after apply)
                   + length    = 2
                   + separator = "-"
                 }

             Plan: 20 to add, 0 to change, 0 to destroy.

             Changes to Outputs:
               + url              = (known after apply)
               + userPoolClientId = (known after apply)
               + userPoolId       = (known after apply)
lambda-auth
lambda-auth  random_pet.random-name (random-name): Creating...
             random_pet.random-name (random-name): Creation complete after 0s [id=refined-locust]
             aws_iam_role.lambda-exec (lambda-exec): Creating...
             aws_api_gateway_rest_api.api-gw (api-gw): Creating...
lambda-auth  aws_s3_bucket.bucket (bucket): Creating...
             aws_cognito_user_pool.UserPool (UserPool): Creating...
             aws_api_gateway_rest_api.api-gw (api-gw): Creation complete after 0s [id=clylws7uvb]
             aws_api_gateway_resource.lambda-auth (authenticate-user-resource): Creating...
             aws_s3_bucket.bucket (bucket): Creation complete after 1s [id=cdktf-lambda-auth20240317134334160300000001]
             aws_s3_object.lambda-archive (lambda-archive): Creating...
             aws_api_gateway_resource.lambda-auth (authenticate-user-resource): Creation complete after 1s [id=5jx9pk]
             aws_api_gateway_method.lambda-auth (AuthenticateUserApiGatewayMethod): Creating...
             aws_s3_object.lambda-archive (lambda-archive): Creation complete after 0s [id=v0.1/archive.zip]
             aws_api_gateway_method.lambda-auth (AuthenticateUserApiGatewayMethod): Creation complete after 0s [id=agm-clylws7uvb-5jx9pk-POST]
             aws_iam_role.lambda-exec (lambda-exec): Creation complete after 1s [id=cdktf-lambda-auth-refined-locust]
             aws_iam_role_policy_attachment.lambda-managed-policy (lambda-managed-policy): Creating...
             aws_iam_role_policy.LambdaRolePolicy (LambdaRolePolicy): Creating...
             aws_lambda_function.auth-lambda-func (auth-lambda-func): Creating...
             aws_iam_role_policy_attachment.lambda-managed-policy (lambda-managed-policy): Creation complete after 0s [id=cdktf-lambda-auth-refined-locust-20240317134334821400000003]
             aws_iam_role_policy.LambdaRolePolicy (LambdaRolePolicy): Creation complete after 0s [id=cdktf-lambda-auth-refined-locust:terraform-20240317134334771200000002]
             aws_cognito_user_pool.UserPool (UserPool): Creation complete after 1s [id=us-east-1_cZTiTRfvp]
             aws_cognito_user_pool_domain.UserPoolDomain (UserPoolDomain): Creating...
             aws_ssm_parameter.UserPoolIdParameter (UserPoolIdParameter): Creating...
             aws_cognito_user_pool_client.UserPoolClient (UserPoolClient): Creating...
             aws_cognito_user_pool_client.UserPoolClient (UserPoolClient): Creation complete after 0s [id=580eo9fnd48n2nt2je5imah94c]
             aws_ssm_parameter.UserPoolClientIdParameter (UserPoolClientIdParameter): Creating...
             aws_ssm_parameter.UserPoolIdParameter (UserPoolIdParameter): Creation complete after 0s [id=/lambda-auth/userPoolId]
             aws_ssm_parameter.UserPoolClientIdParameter (UserPoolClientIdParameter): Creation complete after 0s [id=/lambda-auth/userPoolClientId]
lambda-auth  aws_cognito_user_pool_domain.UserPoolDomain (UserPoolDomain): Creation complete after 0s [id=pos-fiap-lanchonete-lambda-auth-refined-locust]
lambda-auth  aws_lambda_function.auth-lambda-func (auth-lambda-func): Still creating... [10s elapsed]
lambda-auth  aws_lambda_function.auth-lambda-func (auth-lambda-func): Creation complete after 14s [id=cdktf-lambda-auth-refined-locust]
             aws_lambda_permission.apigw-lambda (apigw-lambda): Creating...
             aws_api_gateway_integration.lambda-auth (AuthenticateUserApiGatewayIntegration): Creating...
             aws_api_gateway_integration.lambda-auth (AuthenticateUserApiGatewayIntegration): Creation complete after 0s [id=agi-clylws7uvb-5jx9pk-POST]
             aws_api_gateway_deployment.lambda-auth (api-gw-deployment): Creating...
lambda-auth  aws_lambda_permission.apigw-lambda (apigw-lambda): Creation complete after 0s [id=terraform-20240317134348591500000004]
             aws_api_gateway_deployment.lambda-auth (api-gw-deployment): Creation complete after 0s [id=2yuteh]
             aws_api_gateway_stage.lambda-auth (api-gw-stage): Creating...
             aws_api_gateway_stage.lambda-auth (api-gw-stage): Creation complete after 0s [id=ags-clylws7uvb-v1]
             aws_ssm_parameter.LambdaUrl (LambdaUrl): Creating...
             aws_ssm_parameter.LambdaUrl (LambdaUrl): Creation complete after 0s [id=/lambda-auth/lambdaUrl]

             Apply complete! Resources: 20 added, 0 changed, 0 destroyed.

             Outputs:

             url = "https://clylws7uvb.execute-api.us-east-1.amazonaws.com/v1"
             userPoolClientId = "580eo9fnd48n2nt2je5imah94c"
             userPoolId = "us-east-1_cZTiTRfvp"

  lambda-auth
  url = https://clylws7uvb.execute-api.us-east-1.amazonaws.com/v1
  userPoolClientId = 580eo9fnd48n2nt2je5imah94c
  userPoolId = us-east-1_cZTiTRfvp


```

</details>